app/Filters/OnlineUserFilter.php

DELETE FROM `online_users`
WHERE `last_activity` < 1752416566
SELECT *
FROM `online_users`
WHERE `ip_address` = '192.168.10.192'
UPDATE `online_users` SET `last_activity` = 1750393312
WHERE `ip_address` = '192.168.10.192'
INSERT INTO `online_users` (`ip_address`, `user_agent`, `last_activity`) VALUES ('192.168.10.192', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/137.0.0.0 Safari/537.36', 1750147248)
---
    public function before(RequestInterface $request, $arguments = null)
    {
        date_default_timezone_set('Asia/Jakarta');
        $db = \Config\Database::connect();

        $ip = $request->getIPAddress();
        $userAgent = $_SERVER['HTTP_USER_AGENT'] ?? 'unknown';
        $now = time();

        $db->table('online_users')->where('last_activity <', $now - 180)->delete();

        $existing = $db->table('online_users')
            ->where('ip_address', $ip)
            ->get()
            ->getRow();

        if ($existing) {

            $db->table('online_users')->where('ip_address', $ip)->update([
                'last_activity' => $now
            ]);
        } else {

            $db->table('online_users')->insert([
                'ip_address' => $ip,
                'user_agent' => $userAgent,
                'last_activity' => $now
            ]);