app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `online_users`
WHERE `last_activity` >= 1752416566
SELECT *
FROM `pemesanan_detail`
JOIN `pemesanan` ON `pemesanan`.`id_p` = `pemesanan_detail`.`id_p`
WHERE `pemesanan_detail`.`status` NOT IN ('Selesai','Dibatalkan')
GROUP BY `pemesanan`.`id_p`
SELECT SUM(`harga`) AS `harga`
FROM `pemesanan_detail`
WHERE `status` = 'Selesai'
SELECT DATE_FORMAT(pemesanan.tanggal_pemesanan, '%Y-%m') AS bulan, SUM(pemesanan_detail.harga) as total
FROM `pemesanan_detail`
JOIN `pemesanan` ON `pemesanan`.`id_p` = `pemesanan_detail`.`id_p`
WHERE `pemesanan_detail`.`status` IN ('Selesai')
GROUP BY DATE_FORMAT(pemesanan.tanggal_pemesanan, '%Y-%m')
ORDER BY DATE_FORMAT(pemesanan.tanggal_pemesanan, '%Y-%m')
---
    public function index()
    {
        $userModel = new UserModel();
        $jumlahUser = $userModel->countAll();

        $db = \Config\Database::connect();
        $now = time();

        $onlineUser = $db->table('online_users')
            ->where('last_activity >=', $now - 300)
            ->countAllResults();

        $pesananBaru = $db->table('pemesanan_detail')
            ->join('pemesanan', 'pemesanan.id_p = pemesanan_detail.id_p')
            ->whereNotIn('pemesanan_detail.status', ['Selesai', 'Dibatalkan'])
            ->groupBy('pemesanan.id_p')
            ->get()
            ->getNumRows();

        $pesananSelesai = $db->table('pemesanan_detail')
            ->join('pemesanan', 'pemesanan.id_p = pemesanan_detail.id_p')
            ->whereIn('pemesanan_detail.status', ['Selesai'])
            ->groupBy('pemesanan.id_p')
            ->get()
            ->getNumRows();

        $totalSelesai = $db->table('pemesanan_detail')
            ->select('SUM(harga) AS total')
            ->where('status', 'Selesai')
            ->get()
            ->getRow()
            ->total;

        $totalPerbulan = $db->table('pemesanan_detail')
            ->select("DATE_FORMAT(pemesanan.tanggal_pemesanan, '%Y-%m') AS bulan, SUM(pemesanan_detail.harga) as total")
            ->join('pemesanan', 'pemesanan.id_p = pemesanan_detail.id_p')
            ->whereIn('pemesanan_detail.status', ['Selesai'])
            ->groupBy("DATE_FORMAT(pemesanan.tanggal_pemesanan, '%Y-%m')")
            ->orderBy("DATE_FORMAT(pemesanan.tanggal_pemesanan, '%Y-%m')")
            ->get()
            ->getResultArray();

SELECT `kategori`.`kategori`, COUNT(*) as jumlah
FROM `pemesanan_detail`
JOIN `kategori` ON `kategori`.`id_ktg` = `pemesanan_detail`.`id_ktg`
WHERE `pemesanan_detail`.`status` IN ('Selesai','Dibatalkan')
GROUP BY `kategori`.`kategori`
---
            ->orderBy('pemesanan.id_p', 'DESC')
            ->get();

        $kategoriList = $db->table('pemesanan_detail')
            ->select('kategori.kategori, SUM(pemesanan_detail.jumlah) as jumlah')
            ->join('kategori', 'kategori.id_ktg = pemesanan_detail.id_ktg')
            ->whereIn('pemesanan_detail.status', ['Selesai', 'Dibatalkan'])
            ->groupBy('kategori.kategori')
            ->get()
            ->getResultArray();

SELECT `stok`.*, `kategori`.`kategori`
FROM `stok`
JOIN `kategori` ON `kategori`.`id_ktg` = `stok`.`id_ktg`
---
    public function dataStok()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('stok');
        $builder->select('stok.*, kategori.kategori');
        $builder->join('kategori', 'kategori.id_ktg = stok.id_ktg');
        $query = $builder->get();