app/Controllers/Admin.php

        $data['transaksi'] = $query->getResultArray();
        date_default_timezone_set('Asia/Jakarta');
        $now = time();
        $onlineUsers = $db->table('online_users')
            ->where('last_activity >=', $now - 1800)
            ->get()->getResultArray();
---
SELECT *
FROM `online_users`
WHERE `last_activity` >= 1750393204