app/Controllers/Keranjang.php

SELECT *
FROM `keranjang`
WHERE `id_u` = '25'
SELECT *
FROM `stok`
SELECT *
FROM `kategori`
SELECT *
FROM `users`
WHERE `users`.`id_u` = '25'
---
    public function index()
    {
        $id_user = session()->get('id_u');
        $keranjangModel = new KeranjangModel();
        $kategoriModel = new KategoriModel();
        $stokModel = new StokModel();
        $userModel = new UserModel();

        $data['keranjang'] = $keranjangModel->where('id_u', $id_user)->findAll();
        $data['stok_batik'] = $stokModel->findAll();
        $data['kategori'] = $kategoriModel->findAll();
        $data['user'] = $userModel->find($id_user);

INSERT INTO `keranjang` (`id_u`, `jenis`, `model`, `ukuran`, `lengan`, `jumlah`, `harga`) VALUES ('25', '', '', 'L', 'Lengan Panjang', 1, 55000)
---
    public function tambah()
    {
        $model = new KeranjangModel();

        $id_user = session()->get('id_u');
        $jenis = $this->request->getPost('jenis');
        $model_batik = $this->request->getPost('model');
        $ukuran = $this->request->getPost('ukuran');
        $lengan = $this->request->getPost('lengan');

        $harga = $this->hitungHarga($jenis, $model_batik, $ukuran, $lengan);

        $model->insert([
            'id_u' => $id_user,
            'jenis' => $jenis,
            'model' => $model_batik,
            'ukuran' => $ukuran,
            'lengan' => $lengan,
            'harga' => $harga,
        ]);

SELECT *
FROM `keranjang`
WHERE `id_u` = '25'
SELECT *
FROM `users`
WHERE `id_u` = '25'
 LIMIT 1
---
    public function checkout()
    {
        $model = new KeranjangModel();
        $id_user = session()->get('id_u');

        $keranjang = $model->where('id_u', $id_user)->findAll();
        if (empty($keranjang)) {
            return redirect()->to('/keranjang')->with('error', 'Keranjang kosong.');
        }

        $userModel = new UserModel();
        $user = $userModel->where('id_u', $id_user)->first();

SELECT *
FROM `users`
WHERE `id_u` = '25'
 LIMIT 1
SELECT *
FROM `keranjang`
WHERE `id_u` = '25'
---
    public function token()
    {
        $id_user = session()->get('id_u');

        $modelKeranjang  = new KeranjangModel();
        $modelPemesanan  = new PemesananModel();
        $modelDetail     = new DetailModel();
        $stokModel       = new StokModel();
        $userModel       = new UserModel();

        $user = $userModel->where('id_u', $id_user)->first();
        $keranjang = $modelKeranjang->where('id_u', $id_user)->findAll();