app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'dhio'
 LIMIT 1
---
    public function process()
    {
        $userModel = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Validasi input
        if (!$this->validate([
            'username' => 'required',
            'password' => 'required',
        ])) {
            return redirect()->back()->withInput()->with('error', 'Username dan password harus diisi.');
        }

        $user = $userModel->where('username', $username)->first();

SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function processAdmin()
{
    $adminModel = new AdminModel();

    // Ambil dan bersihkan input
    $username = trim($this->request->getPost('username'));
    $password = trim($this->request->getPost('password'));

    // Validasi input kosong
    if (!$this->validate([
        'username' => 'required',
        'password' => 'required',
    ])) {
        return redirect()->back()->withInput()->with('error', 'Username dan password harus diisi.');
    }

    // Cari user berdasarkan username
    $user = $adminModel->where('username', $username)->first();