app/Controllers/Pemesanan.php

SELECT *
FROM `pemesanan`
WHERE `id_u` = '25'
---
    public function index()
    {
        $id_user = session()->get('id_u');
        if (!$id_user) {
            return redirect()->to('/login')->with('error', 'Silakan login dulu.');
        }

        $pemesananModel = new \App\Models\PemesananModel();
        $detailModel = new \App\Models\DetailModel();

        $pemesanan = $pemesananModel->where('id_u', $id_user)->findAll();