app/Controllers/Transaksi.php

SELECT `pemesanan`.`id_p`, `pemesanan`.`id_u`, `pemesanan`.`nama`, `pemesanan`.`tanggal_pemesanan`, `pemesanan_detail`.`status`, SUM(pemesanan_detail.harga * pemesanan_detail.jumlah) as total_harga, GROUP_CONCAT(CONCAT(
                     pemesanan_detail.jenis, " - ", `pemesanan_detail`.`model`, " - ", `pemesanan_detail`.`ukuran`, " - ", `pemesanan_detail`.`lengan`, " - Jumlah: ", `pemesanan_detail`.`jumlah`, " - Rp ", pemesanan_detail.harga
                 ) SEPARATOR "|") AS detail_items
FROM `pemesanan_detail`
JOIN `pemesanan` ON `pemesanan`.`id_p` = `pemesanan_detail`.`id_p`
WHERE `pemesanan_detail`.`status` NOT IN ('Selesai','Dibatalkan')
GROUP BY `pemesanan`.`id_p`
ORDER BY `pemesanan`.`id_p` DESC
---
    public function dataTransaksi()
    {
        $db = \Config\Database::connect();
        $tanggal = $this->request->getGet('tanggal');

        $builder = $db->table('pemesanan_detail')
            ->select(
                'pemesanan.id_p,
                 pemesanan.id_u,
                 pemesanan.nama,
                 pemesanan.tanggal_pemesanan,
                 pemesanan_detail.status,
                 SUM(pemesanan_detail.harga) as total_harga,
                 GROUP_CONCAT(CONCAT(
                     pemesanan_detail.jenis, " - ",
                     pemesanan_detail.model, " - ",
                     pemesanan_detail.ukuran, " - ",
                     pemesanan_detail.lengan, " - Jumlah: ",
                     pemesanan_detail.jumlah, " - Rp ",
                     pemesanan_detail.harga
                 ) SEPARATOR "|") AS detail_items'
            )
            ->join('pemesanan', 'pemesanan.id_p = pemesanan_detail.id_p')
            ->whereNotIn('pemesanan_detail.status', ['Selesai', 'Dibatalkan']);

        if (!empty($tanggal)) {
            $builder->where("DATE(pemesanan.tanggal_pemesanan)", $tanggal);
        }

        $query = $builder
            ->groupBy('pemesanan.id_p')
            ->orderBy('pemesanan.id_p', 'DESC')
            ->get();

SELECT *
FROM `pemesanan_detail`
WHERE `id_p` = '93'
SELECT *
FROM `pemesanan`
WHERE `id_p` = '93'
---
    public function editTransaksi($id_p)
    {
        $db = \Config\Database::connect();
        $pemesanan = $db->table('pemesanan')->where('id_p', $id_p)->get()->getRowArray();
        $details = $db->table('pemesanan_detail')->where('id_p', $id_p)->get()->getResultArray();

UPDATE `pemesanan` SET `id_u` = '25'
WHERE `id_p` = '104'
UPDATE `pemesanan_detail` SET `jenis` = 'Batik 2', `model` = 'Model 1', `ukuran` = 'L', `lengan` = 'Lengan Panjang', `harga` = '200000', `jumlah` = '2', `status` = 'Selesai'
WHERE `id_detail` = '102'
---
    public function updateTransaksi($id_p)
    {
        $db = \Config\Database::connect();

        $db->table('pemesanan')->where('id_p', $id_p)->update([
            'id_u' => $this->request->getPost('id_u'),
        ]);

        $status   = $this->request->getPost('status');
        $detailId = $this->request->getPost('detail_id');
        $jenis    = $this->request->getPost('jenis');
        $model    = $this->request->getPost('model');
        $ukuran   = $this->request->getPost('ukuran');
        $lengan   = $this->request->getPost('lengan');
        $harga    = $this->request->getPost('harga');
        $jumlah   = $this->request->getPost('jumlah');

        for ($i = 0; $i < count($detailId); $i++) {
            $db->table('pemesanan_detail')
                ->where('id_detail', $detailId[$i])
                ->update([
                    'jenis'  => $jenis[$i],
                    'model'  => $model[$i],
                    'ukuran' => $ukuran[$i],
                    'lengan' => $lengan[$i],
                    'harga'  => $harga[$i],
                    'jumlah' => $jumlah[$i],
                    'status' => $status
                ]);